// Задача 15: Напишите программу, которая принимает на вход цифру, 
// обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

Console.WriteLine("Введите номер дня недели: ");
int day = int.Parse(Console.ReadLine());
if (day < 1 || day > 7)
{
    Console.WriteLine("Данного дня недели не существует, введите корректный номер (от 1 до 7).");
}
else if (day <= 5)
{
    Console.WriteLine("Нет, будний день.");
}
else if (5 < day || day < 7)
{
    Console.WriteLine("Да, выходной день.");
}